Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N12A.tmx
Source language: en_us
Languages: zh_cn

source: Jungle Battles
zh_cn: 丛林战争

source: The wanderings of the tribe brought them often near the closed and silent cabin by the little land-locked harbor.
zh_cn: 族群的迁移使他们经常靠近封闭而沉静的小屋，小屋位于内陆港湾附近。

source: To Tarzan this was always a source of never-ending mystery and pleasure.
zh_cn: 对于泰山来说，这里带给他的总是无尽的神秘和快乐。

source: He would peek into the curtained windows, or, climbing upon the roof, peer down the black depths of the chimney in vain endeavor to solve the unknown wonders that lay within those strong walls.
zh_cn: 他会从挂着窗帘的窗户处偷偷地往里看，或者爬上屋顶努力地从幽深的烟囱往里看，他徒劳地想想要搞明白屋内到底有什么。

source: His child-like imagination pictured wonderful creatures within, and the very impossibility of forcing entrance added a thousandfold to his desire to do so.
zh_cn: 他孩子般的想象力使其对屋内浮想联翩。虽然一切尝试都是徒劳，但他还是要去做。

source: He could clamber about the roof and windows for hours attempting to discover means of ingress, but to the door he paid little attention, for this was apparently as solid as the walls.
zh_cn: 他常爬上屋顶或窗户数个小时，试图找到进入房间的方法，但对于门，他却很少在意，因为他觉得门结实得和墙一样。

source: It was in the next visit to the vicinity, following the adventure with old Sabor, that, as he approached the cabin, Tarzan noticed that from a distance the door appeared to be an independent part of the wall in which it was set, and for the first time it occurred to him that this might prove the means of entrance which had so long eluded him.
zh_cn: 而另一次跟踪老萨波到小屋附近，从远处看去，门看起来是设在墙上的独立部件。这让他第一次灵机一现，也许这就是他一直找寻的入口。

source: He was alone, as was often the case when he visited the cabin, for the apes had no love for it; the story of the thunder-stick having lost nothing in the telling during these ten years had quite surrounded the white man's deserted abode with an atmosphere of weirdness and terror for the simians.
zh_cn: 大多数情况下，他都是一个人来小屋，因为其他的猩猩不喜欢这个小屋，这些年里，那个雷电交加的故事已无人提起。这所白人遗留的小屋笼罩着一种恐怖和古怪的气息。

source: The story of his own connection with the cabin had never been told him.
zh_cn: 没有人告诉他与这个小屋的关系。

source: The language of the apes had so few words that they could talk but little of what they had seen in the cabin, having no words to accurately describe either the strange people or their belongings, and so, long before Tarzan was old enough to understand, the subject had been forgotten by the tribe.
zh_cn: 猩猩的语言很贫乏，对于小屋的所见，他们很难说清，他们无法清楚地说明陌生人的情况或是他们的物品，所以，在泰山懂事前，关于小屋发生的事情，族群中的猩猩已将这些都忘记了。

source: Only in a dim, vague way had Kala explained to him that his father had been a strange white ape, but he did not know that Kala was not his own mother.
zh_cn: 卡娜只是模糊地提起他的身世，说他的父亲是一只奇特的白猩猩，但泰山一直以为卡娜就是他的母亲。

source: On this day, then, he went directly to the door and spent hours examining it and fussing with the hinges, the knob and the latch.
zh_cn: 这一天，他径直来到小屋门前，他仔细地查看着，几个小时，他都在摆弄着门上的铰链、把手和锁子。

source: Finally he stumbled upon the right combination, and the door swung creakingly open before his astonished eyes.
zh_cn: 终于，他偶然找到了正确的方法，门吱吱呀呀地打开了，他的眼里都是惊讶。

source: For some minutes he did not dare venture within, but finally, as his eyes became accustomed to the dim light of the interior he slowly and cautiously entered.
zh_cn: 几分钟的时间，他不敢进入屋内。但当他的眼睛适应了屋内的昏暗光线时，他最终还是慢慢地、小心翼翼地进入了小屋。

source: In the middle of the floor lay a skeleton, every vestige of flesh gone from the bones to which still clung the mildewed and moldered remnants of what had once been clothing.
zh_cn: 在小屋的地板中间躺着一具骷髅，每一处骨头上的肉都没有了，骷髅上附着这一些发霉腐烂的衣服残片。

source: Upon the bed lay a similar gruesome thing, but smaller, while in a tiny cradle near-by was a third, a wee mite of a skeleton.
zh_cn: 小屋的床上同样躺一具可怕骷髅，不过要小一些，而在一个小摇篮边还有一具骨骼，是很小的动物骨骼。

source: To none of these evidences of a fearful tragedy of a long dead day did little Tarzan give but passing heed.
zh_cn: 很久以前发生的悲剧给小泰山没有留下任何记忆，就这样过去了。

source: His wild jungle life had inured him to the sight of dead and dying animals, and had he known that he was looking upon the remains of his own father and mother he would have been no more greatly moved.
zh_cn: 狂野的丛林生活使他对动物的死以及垂死习以为常，即便他知道自己看到的是父母的遗骸，他也不会有很大的感情波动。

source: The furnishings and other contents of the room it was which riveted his attention.
zh_cn: 房间的陈设和其他的物品引起了他的注意。

source: He examined many things minutely--strange tools and weapons, books, paper, clothing--what little had withstood the ravages of time in the humid atmosphere of the jungle coast.
zh_cn: 他仔细地查看着屋内的东西——奇怪的工具、武器、书籍、纸张以及衣服，这些东西经历了长时间的潮湿丛林海岸气候侵蚀，已经变得面目全非。

source: He opened chests and cupboards, such as did not baffle his small experience, and in these he found the contents much better preserved.
zh_cn: 他打开箱子和柜子，这样的小事情难不倒他，箱子和柜子里的东西保存地比较完好。

source: Among other things he found a sharp hunting knife, on the keen blade of which he immediately proceeded to cut his finger.
zh_cn: 他在里面找到了一把锋利的猎刀，一不小心，锐利的刀刃割破了他的手指。

source: Undaunted he continued his experiments, finding that he could hack and hew splinters of wood from the table and chairs with this new toy.
zh_cn: 他并没有太在意，继续把玩猎刀，他发现可以通过这个新“玩具”从桌子和椅子上砍下碎片。

source: For a long time this amused him, but finally tiring he continued his explorations.
zh_cn: 这让他玩性十足了好一会，但后来玩得有点累了，所以他又开始了他的探索。

source: In a cupboard filled with books he came across one with brightly colored pictures--it was a child's illustrated alphabet--
zh_cn: 在一个装满书的柜子里，他发现了一个鲜亮的图片——这是一个小孩的识字图——

source: is for Archer
zh_cn: A代表的是弓箭手，

source: Who shoots with a bow.
zh_cn: 他正在射箭。

source: is for Boy,
zh_cn: B代表的是男孩，

source: His first name is Joe.
zh_cn: 男孩的名字叫乔。
